{
    "Uzumaki": "Located a little down Washington Blvd from the main strip of Culver City, Uzumaki sits as one of the premier sushi spots in the area. When you go, you have three options: omakase, a la carte, or some combination of both! The two smallest options may not be enough for some, so it may be wise to do omakase with a little extra bump if those selections strike your fancy. Everything at Uzumaki from the nigiri, to the rolls, to even the salads are delightful and the fish is super fresh. When the meal is over, you certainly won’t regret coming to this cute Westside spot to ease your sushi addiction.\n",
    "C&M Cafe": "C&M Cafe is a fantastic place to get classic brunch items with a twist. They have the best breakfast burritos on the block and you can quote me on that; I highly recommend their chorizo, duck, AND pork belly varieties. They are wrapped with a flakey, thin tortilla, and filled with meats, fresh vegetables, crispy potatoes, and their creamy house sauce. C&M Cafe is the place to go when you are craving some classic and reimagined brunch foods done up to perfection.\n",
    "Iron Teapot": "Iron Teapot is a stylish new-age dim sum restaurant in Culver City that is trying to put a twist on the classic Chinese experience. They have a variety of different dim sum, ranging from rainbow and squid ink xiao long bao, to BBQ pork buns, and har gow. What is really fun about Iron Teapot though is their robotic cat servers, which can bring your dumplings right to your table. Additionally, if you want to learn how to make dumplings yourself, Iron Teapot offers adorable dim sum making classes where you can make animal dim sum that are as cute as they are delicious.\n",
    "The Apple Pan": "The Apple Pan's slogan, \"Quality Forever\", seems like it's coming true with how long this place has been around. I am a fourth generation Angelino to have visited this spot and for good reason. My grandpa even took my grandma on one of their first dates here!! Their hickory cheese burger is one of my favorite burgers in town, and if you get well done fries they come out perfectly crispy and soft inside. However, don't forget the finishing touch with their famous Apple or Banana Cream Pies, which create a perfect ending to a meal that's been around for decades.\n",
    "Maple Block Meat Co.": "A staple for BBQ on the westside, Maple Block puts out amazing smoked brisket and some of the best turkey I have ever tasted. And I hate turkey. Watch for their usual DineLA deals twice a year.\n",
    "Lonzo's Restaurant": "Lonzo's is a very unique restaurant. One one hand, it serves some of the best lomo saltado, ceviche, and Peruvian seafood in a 2 mile radius, and on the other it is a bakery that has delicious baked goods and breads. If you are in the market for either of these on the westside, I highly recommend Lonzo's as it will quickly become your new local Peruvian joint.\n",
    "Dolce Isola": "It would be a shame if people only knew Dolce Isola as the bakery for The Ivy (an upscale restaurant not featured on this website). Isola is a bright, delicious and affordable breakfast/lunch spot in its own right, featuring sandwiches, breads,  cookies, and gelato. I personally recommend the fried chicken sandwich for a sumptuous and slightly spicy treat, finished with a crunchy chocolate chip cookie atop a scoop of stracciatella gelato. \n",
    "Roberta's": "Hailing from New York, this Culver City Italian restaurant hosts amazing salads and pizza, including my personal favorite, The Bee Sting, which comes with salty, spicy pepperoni and sweet honey. Many have tried emulating these flavors, but Roberta's is my personal favorite of this salty, spicy, sweet combo that has gotten very popular very quickly.\n",
    "Little Fatty": "This trendy \"Taiwanese Soul Food\" restaurant really does touch the soul. I showed my dad this restaurant one time and he proceeded to go probably 7 times in the next 5 months. Regarding specific dishes, I recommend the Chinese BBQ Pork, which has a whole slow cooked pork shank covered in a sweet sticky sauce. General Tso's Cauliflower is also an amazing option as well, with a crispy exterior covered in a delightful sauce. You really cannot go wrong with anything from Little Fatty, and I would highly recommend you give it a try next time you are craving Taiwanese food!\n",
    "Pasta Sisters": "Pasta sisters brings casual Italian cuisine to LA. Don’t think that that comes with an inferior product however; all of pasta sisters’ items are phenomenal, from the porchini mushroom, to the bolognese and the pesto. You can combine these sauces for the pasta of your choosing, creating a lovely personalized experience. If you want, you can also get the extremely photogenic ball of burrata on top, but I prefer mine with just parmesan cheese.\n",
    "Food": "Despite having the absolute worst SEO game on the block, don’t let ‘FOOD West LA’ (optimal search term) fool you. For affordable breakfast plates, sandwiches and even a market, you can’t get much better than this casual eatery on Pico Boulevard. I’d highly recommend their tofu scramble, a vegan option that people of all dietary preferences can enjoy! \n",
    "Brother's Cousins Tacos": "It's hard to get good authentic tacos on the westside, but Brother's Cousins certainly delivers that. Hit up this cash only taco stand to get fantastic various tortilla-wrapped delights. Tacos, burritos, quesadillas, you name it: they will do it and they will do it well.\n",
    "Al's Hot Chicken": "Al's is a great place to get hot chicken in West LA among the larger chains. Their spicy chicken seasoning is delicious, and certainly rivals even the most popular spots around town. Get it on a sandwich, boneless, or bone in, and with a side of fries; you really can’t go wrong.\n",
    "Father's Office": "A modern classic for new-age burgers and beer alike, Father’s Office is a great spot for a night out, whether splitting some fries with a date, ordering another round with your friends, or simply sitting solo on their patio, beer in-hand. \n",
    "Blasteran": "This innovative Indonesian restaurant is serving up dishes from their delightful Rendang Noodles to the heavy-hitting Cowboy BBQ burger. Their fusion is right on the money, getting American and Indonesian classics and pushing them together into one. It seems like every time I return, it gets more and more popular, so make sure to get there soon before the lines get too long!\n",
    "Pop's Bagels": "You may never buy a bagel from the supermarket again... (jk). But for real, Pop's has delicious, chewy, bread-annuli, paired with equally compelling topping options. This makes for the ideal breakfast or brunch for the bagel lover.\n",
    "Bianca Bakery": "Whether you’re after a fresh-made baguette for an upcoming dinner party, or a rich and tasty pasta dish, the Culver City Platform’s Bianca Bakery has you covered. Featuring a sit-down restaurant and a bakery counter filled to the brim with bread loaves and baked goods, Bianca is a sumptuous option for breakfast, lunch, dinner, or any meal in-between.\n",
    "Arth": "Arth is a fantastic new take on classic Indian dishes. It stays true to its roots while venturing out just the slightest, making a great experience for Indian food connoisseurs and first-timers alike. My highlights include the butter chicken, chicken kebab, and paneer masala.\n",
    "Pizzeria Sei": "Pizzeria Sei is the baby of a pizza restaurant and sushi bar. You walk in and expect to be served a 10 course omakase, but in reality, you are served some of the most delightful pizzas and salads in LA. Their crust is phenomenal and *every* pizza on the menu is a home run, while their caesar and salami salads are ridiculous as well.\n",
    "Kazan": "From the founder of the sadly now-commoditized Tatsu comes Kazan, a brilliant Michelin Bib Gourmand recommended ramen restaurant that breathes an elegant air to Japanese ramen. If you like ramen, this place is worth going to at least once, if not time and time again. The broth is magical in the depth of flavor and intensity, and brings a bit of novelty by incorporating non-traditional elements such as truffles. The noodles are also perfectly al dente and have a silky texture I've never seen recreated elsewhere. I would recommend the Signature #1 and the Lei Ramen. If you are looking to redefine your definition of Japanese ramen, give Kazan a try!\n",
    "Ramen Nagi": "Hailing from Japan, Ramen Nagi shakes up the Westfield Century City dining landscape, with its \"King\" ramen flavors. These range from original to spicy to even pesto (I have yet to try that one I am a litle scared).\n",
    "Din Tai Fung": "This Taiwan export needs no introduction. Odds are, someone has told you about it already, or you’ve seen the line steadily snaking out of their many locations. Sleep soundly knowing that Din Tai Fung more than lives up to the hype. It’s a rite of passage to try their deliciously juicy Xiao Long Bao, but don’t let the spicy wontons pass you by either. \n",
    "Northern Cafe": "Northern Cafe is a great place for a cheap, fast, casual meal and has a lot of different Chinese specialties that are fantastic for the price point. My favorites are the xiao long bao and the beef rolls, but the fried rice, noodles, and many other dishes are just as good.\n",
    "KazuNori Handroll Bar": "KazuNori is known for their omakase options for handrolls. Even if you are not a handroll fan, KazuNori stays true to the basics with toasted crispy seaweed, warm and plump grains of rice, and the freshest of seafood. Each roll is simple, made with the best ingredients; this is what makes it so delicious. Moreover, as the name implies, the diners sit around a bar where you get to see the chefs prepare the handrolls for you in real time. KazuNori is an experience for all sushi lovers and sushi beginners alike!\n",
    "Pitfire Pizza": "Pitfire has some of the best crust in the pizza game. Doughy, airy, and slightly burnt for that perfect char. Additionally, they have a fantastic rotating seasonal pie selection and salads that are perfect for a casual meal any time. My favorite pizzas here are the heirloom tomato pizza, brussels sprouts and bacon pizza, and the burrata pie.\n",
    "Feast From The East": "Hear me out on this one- even though the NAME is interesting and would not pass by today’s standards. If you want the best Chinese Chicken Salad ever made, Feast from the East is for you. The lettuce is fresh, the wonton crisps are crunchy, the chicken is chickening, and the dressing is perfectly sweet and sour. Serving it up from their Westwood location for more than 40 years, FFTE is a westside staple for cheap, filling, and delicious salad as well as amazing crispy sesame wings. \n",
    "Attari": "In the midst of a quaint little Westwood courtyard, Attari(made of both Attari Sandwich Shop and Attari Grill,) is one of the best options for Persian food on Westwood boulevard, and anyone who’s ever been down that street knows that’s no mean feat. Grilled meats, sandwiches and fresh Osh are all on the menu at this LA Persian staple, and with affordable prices and a casual atmosphere, it might be just what you’re looking for.\n",
    "Sunnin": "Sunnin is known for their amazing Lebanese/Mediterranean faire, with a chill, relaxed atmosphere. Their meats and fish are outstanding and come with a medley of side dishes to complete the dishes. If you like eggplant, don’t skip the baba ghanoush: one of my faves!\n",
    "Mogumogu": "Ramen…without the broth? Strange as it sounds, Mogumogu is one of the best ramen restaurants in Los Angeles, and their best ramen is completely soup-free. Mazemen, the restaurant’s specialty, is made with thick ramen noodles coated in a sauce bursting with flavor, topped with your favorite ramen extras. However, the creation of the meal doesn’t end when it comes to your table. When you’re halfway done with your mazemen, the restaurant recommends adding a dose of umami vinegar, completely changing the consistency and flavor of the noodles, and a cup of rice, which soaks up that thick sauce that clings to the noodles throughout your first-half consumption. Mogumogu will make you rethink ramen entirely, and expand your horizons in the best way. Fun fact: Roy Choi once upon a time (I am not sure the validity of this statement at the moment) said that MoguMogu was his favorite restaurant in LA. I am close to agreeing with him. \n",
    "Tsujita LA Artisan Noodle": "Tsujita is known for their tsukemen: cold ramen noodles served with a hot flavorful broth. You can enjoy tsukemen by dipping the thick and freshly boiled noodles into the broth filled with charsiu pork, green onions, and a boiled egg. If you are ever tired of regular ramen (even though that seems impossible!), give Tsujita a try. Even though Tsujita is located centrally in Sawtelle, a street with a wide variety of Asian food, Tsujita manages to distinguish itself from the others and consistently has a line waiting for a taste of their incredible tsukemen.\n",
    "Seoul Tofu": "Seoul Tofu is a great place to get Korean food on the westside. Their meats, soon tofu, and bimimbap bowls are all lovely and certainly live up to the Koreatown standard. My favorite is the hot stone bimimbap, which can gets the rice all crispy. Additionally, don't forget to squirt in a healthy amount of their gochujang sauce on the side to create a delicious bowl for any meal.\n",
    "Killer Noodle": "If you are a spice enthusiast, Killer Noodle is absolutely the place for you. Killer Noodle is best known for two styles of ramen: Tokyo and Downtown. The Tokyo style broth is a creamy pork and peanut-based fusion and is a bit sweeter, while Downtown style has a slightly thinner broth that has more sour notes and is vinegar based. Both are exceptional, and are paired with noodles, green onions, ground pork, and tamago onsen (doesn't come with the ramen but you should order it!) to create the final dish. Don't let the talk of spice scare you off- you can customize your spice level from 1-6, so ramen enthusiasts of all spice levels can enjoy this meal. I CANNOT recommend Killer Noodle enough, but don't just take my word for it. Every single person I have taken to Killer Noodle has absolutely loved it, and it is one of the busiest spots on Sawtelle even on a weekday. \n",
    "Marugame Udon": "Marugame is a perfect fast, cheap, delicious, and filling meal. Their udons range from very simple broth and noodles to a complex broth complete with toppings and the works. My favorite is the mentai kamatama and don't forget to pick up those delicious tempuras!\n",
    "Main Chick": "Located in a couple ghost kitchens around Los Angeles, Main Chick is a great addition to the ever expanding hot chicken scene in LA. Their spicy rub on top of the perfectly juicy chicken is actually spicy, so beware. Definitely head over there for a sit down experience (you can even though it's a ghost kitchen!) or order on delivery apps where they are most popular.\n",
    "Cha Cha Chicken": "As is their namesake, Cha Cha Chicken serves amazing chicken. I usually go with the coconut fried version, but their entire menu is filled with Carribean favorites. In terms of the coconut fried chicken, it has extraordinary flavor that comes from that coconut crust and dipping it into their sweet fruity sauce is delightful. Definitely hit up Cha Cha Chicken before a beach day in Santa Monica, or any time if you want some classic Caribbean eats.\n",
    "HiHo Cheeseburger": "HiHo is kind of like a high-end and better In-N-Out. Yes, I am somewhat of an In-N-Out hater and I am proud. Their burgers, shakes, and fries are all delicious and it's a great place to fill that burger craving.\n",
    "Uovo": "Uovo is a great place to get high quality pasta for a relatively reasonable price. They somehow import their pasta all the way from Bologna, Italy every single day, and that quality shines through to their quality product on the plate. My favorites here are the ragu, carbonara, and lasagna.\n",
    "Plan Check": "Plan Check has always been a place for burger innovation. From ketchup leather to peach fry sauce and even pig candy, Plan Check's burgers and burger accoutrements will never fail to disappoint.\n",
    "Ippudo": "Founded in Japan in 1985, Ippudo has blessed us with their classic ramens here in LA. If you're looking for a traditional, yet modern and delightful approach to ramen, Ippudo is the place to be. Make sure to get an egg on top to enjoy this lovely treat, already filled with a variety of delicious accoutrements that depend on which one you get.\n",
    "Sunny Blue": "Sunny blue does omusubi right. Omusubi, also known as onigiri, is a filled rice ball wrapped in toasted nori. Sunny Blue has a variety of delicious fillings, some hitting heavy, some umami, and some fishy and light. The omusubi are additionally always topped with perfectly balanced furikake, completing this wonderful experience.\n",
    "Colapasta": "Colapasta does Italian food right. Perfect freshly made pasta, farm-to-table ingredients, and a lovely selection of dishes, Colapasta has already made its mark on the Santa Monica food scene in their short time here. My favorite is the lasanga, but I have tried many of their dishes and they are all exquisite.\n",
    "Playa Provisions": "After a walk along the bike path or the beach, Playa Provisions is the perfect place to settle in and relax. They have fantastic brunch and dinner options from both land and sea, and have a lovely outdoor patio to relax and enjoy.\n",
    "The Rose": "The Rose has a variety of strong options for every meal. They have a beautiful patio and it is such a lovely experience to sit and chat with friends and family. Their salads, pizzas, and bready breakfast options are all fantastic, and everyone will definitely be able to get something they enjoy, regardless of how picky they may be. Don’t forget to get a drink with your meal though, as their bar also serves up some mean mimosas and cocktails all day.\n",
    "Superba": "Superba is a brunch staple. From their toasts to their salads, sandwiches, and eggs, Superba has a variety of stellar food done right. There is a reason there is always a short wait to sit down: but don't worry, it's usually pretty short. (Efficiency!)\n",
    "Bludso's Bar&Que": "This is my favorite BBQ in LA and I don't believe there is a competitor. The best brisket, the best hot links, the best ribs. It's all there. The brisket is juicy, tender, and flavorful, the ribs are smokey and have a perfect crunchy exterior, and the hot links might be the best sausage I have ever had. If you're missing BBQ or you're a meat lover, Bludso's is a must-go. You won’t find anything like it in an extraordinarily large radius.\n",
    "Salt and Straw": "They removed my old favorite flavor in Avocado Oaxacan Chocolate :(. Then they removed my favorite flavor in Almond Brittle :(. However, I am still here to support Salt and Straw because their flavors are still innovative and delicious. They occasionally have seasonal flavors that are great and it's a great place to go wherever you are in LA.\n",
    "Guisados": "Guisado, meaning stew in Spanish, more than lives up to its name. Their tortilla wrapped stew tacos lend a unique and delicious richness to each and every one of their options, and there’s not a bad choice you could make. My personal recommendations are the Bistek en Salsa Roja, Cochinita Pibil, and Quesadilla con Chorizo, but don’t miss out on the fresh-made horchata, either. \n",
    "Kismet Rotisserie": "I have my opinions about their parent restaurant that shall not be shared here, but Kismet Rotisserie is a great healthy place to pick up classic chicken sandwiches, salads, or just chicken itself! Their sides are also wonderful and this is a great go-to if you need a healthy and quick meal!\n",
    "daybird": "If chicken sandwiches and Sichuan flavors had a baby (or egg?), that would be daybird. daybird features chicken sandwiches with pieces of fried chicken so big to the point of imbalance (definitely a good thing!) and delightful accoutrements that balance the sandwich wonderfully. The chicken is moist and cooked perfectly, and the breading is crisp with Chinese flavor influences. The fresh slaw and their daybird sauce is what brings the dish together, and successfully redefines the chicken sandwich can look like.\n",
    "Sonoratown": "Sonoratown is known for their tortillas that virtually melt in your mouth. However, I don't just eat tortillas when I go to Sonoratown; their meats that fill these tortillas are just as good, and if you're feeling adventurous I highly recommend the tripa which is crispy and packs a huge punch of flavor.\n",
    "Bottega Louie": "When I took my girlfriend's mom to this place, she came back for the next 5 consecutive times she returned to LA. Bottega Louie is a classic LA destination that has it all: bakery, drinks, dinner, and desserts. Moreover, their classy decor and romantic ambiance makes it a great place to enjoy a nice Italian dinner. Even though their pizzas and pastas excel, my two highest recommendations are the portobello mushroom fries and the croissants. Do not take these recommendations lightly.\n",
    "Cabra": "Cabra is Stephanie Izard's second venture into LA after her smash sensation The Girl and The Goat, and the restaurant without The Girl does just as much. First of all, the *vibe* is immaculate. Cabra is located on the rooftop of the Hoxton DTLA, which creates a beautiful vibrant atmosphere with a view of the LA skyline. Izard puts a Peruvian twist on all her dishes at Cabra, and she pulls out all the stops with the various skewers, empanadas, and fish/meat dishes. I would recommend that you try a wide variety of items, but the salmon skewer and the pork shank are my highlights of the menu. Izard impresses yet again with her classic bright flavors, varied textures, and innovative food combinations but now with a Peruvian influence.\n",
    "Afuri": "Downtown LA’s Arts District plays host to a ramen franchise straight out of Tokyo, known for their light, yuzu-flavored broth; a treat for anyone (like my mom) who can find typical ramen broth far too heavy. On this ramen menu, you can’t go wrong with a single option. Be sure to check out the dumplings, as well!\n",
    "The Girl and The Goat": "The Girl and the Goat is one of my favorite restaurants of all time because it has it all: ambiance, food, and most importantly, the novelty factor. There are many fantastic restaurants that stay true to the classics but The Girl and the Goat is not one of them. Every single item that I tried on their menu felt like an experience I had never had before in terms of presentation, texture, or flavor (or a combination of them all!). Since their menu changes seasonally I can't guarantee my recommended picks are on the menu. However, if you get a chance to go, keep your eyes peeled for the stone fruit salad (so so amazing), the duck tartare, the goat liver mousse, or the sticky pork shank. If that wasn't enough to convince you, note that the interior is extremely chic and cute, and makes for a fantastic dining experience. -J\n",
    "Sushi Komasa": "Sushi Komasa is an adorable sushi joint tucked away in the middle of Little Tokyo. This cute sushi bar serves up some of the best non-high-end sushi I have had. You can either order sushi sets or a la carte. I usually choose to order item by item, and some highlights include the salmon belly, the sweet shrimp, and the toro. I also recommend you get the salmon ochazuke (japanese tea poured over rice with roasted salmon). This dish is light and warm, and is the perfect appetizer to your sushi dinner. It is important to note that there are no reservations here, so make sure to come early to put your name down and explore Little Tokyo while you wait for your table! -J\n",
    "Luv2EatThai Bistro": "A Los Angeles Michelin guide location, don’t let Luv2EatThai Bistro’s odd sounding name fool you - this is some of the best Thai food you can get in LA. Their phuket style crab curry is their known specialty, but I’d also highly recommend the more classic curry and noodle dishes, including an exceptional Pad See Ew! Their thai iced tea is also to-die for. \n",
    "26th Ave Tacos": "I've been going to this place for probably around 5 years now, but around 2 years ago it completely blew up on TikTok. The once lone taco stand became a street food haven, with the entire street lined with vendors. Unfortunately, that was shut down by the Health Department, so we are left with this Little Tokyo parking lot location, which I highly recommend for some of the best late night cheap eats in town.\n",
    "Vito's Pizza": "Vito’s Pizza is a super chill spot and serves up some mean NY-style pizza. Walk up to the counter, order, and they’ll start firing up your slices immediately. If you're craving NY style pizza and don’t want too much a hassle, this is definitely a spot you should try out.\n",
    "Angel's Tijuana Tacos": "Angel's is one of my favorite taco stands in LA. They have amazing Al Pastor, Carne Asada, salsas, and the works. If you are going to a Dodger game, the Angel’s on Sunset is always crawling with fans eating before and after the game, so be sure to join them if a Dodger dog doesn’t suit your fancy that night. I highly recommend Angel’s if you're craving this style of taco as there's a reason they have a lot of locations. \n",
    "CoCo Ichibanya": "CoCo Ichibanya is a classic for Japanese curry, and my favorite addition, katsu. My go-to is usualy the pork or chicken cutlet, topping their curry udon. However, getting it with rice and/or egg is just as delicious.\n",
    "Loqui": "Loqui does a great job with their niche in the huge LA taco scene. They have massive, delicious tacos which pile on the meat and toppings (so don't worry about the steep price too much), and their plates turn these meats and toppings into a more formal meal. It's a great place to get casual, mordern Mexican food either in the Arts District or Culver City.\n",
    "Superfine Pizza": "From the group behind Rossoblu, Superfine Pizza is a window to pizza heaven. Just walk up and order one of their 7 or so great pizzas and enjoy their lovely quiet patio in the middle of DTLA. My favorites are the salami honey and the spinach on white, but Superfine does all of their pizzas quite well, and you really cannot go wrong.\n",
    "RiceBox": "Between the char siu, the crackling pork belly, the eggplant, and the duck, it's very difficult to order at RiceBox. Their Cantonese concepts strike home with just about anyone who is fortunate enough to stroll upon their stall at the Spring St Arcade, and it is great for a casual meal with bursting flavors.\n",
    "Langer's Delicatessen": "Of all the Jewish Delis in LA, Langer's is definitely the most famous. Their pastrami consistently ranks supreme in most journalistic publications, and I can attest that it is quite delicious. Definitely get the classic pastrami sandwich or a pastrami rueben and don't forget to get it on rye bread!\n",
    "Factor's Famous Deli": "Factor’s Famous Deli is a Jewish staple of Los Angeles, and for good reason. Some classic items include the matzo ball soup, tongue sandwich, and any of their three incredible chopped salads. However, my most ambitious claim about factors is that they have the best pastrami in LA (go with the thick cut, a standout from other pastrami sandwiches), which goes perfectly on a reuben! \n",
    "Lasita": "While they went from Lasa to Lasita, don't let that fool you into thinking their depths of flavor are any smaller. This Filipino restaurant has unreal rotisserie and Filipino classics like lechon, and you will certainly walk away a happier person after visiting.\n",
    "Amboy Quality Meats": "Located in the midst of Chinatown, Amboy Quality Meats is Alvin Cailan (First We Feast, The Burger Show)’s passion project. Not only does Amboy sell some of the most well-made burgers in Los Angeles, you can also bring a pattie, steak, or other cut of meat home from their on-site butchery! \n",
    "Danny Boy's Pizza": "This is one of the most authentic NY style pizzas in LA. Serving up classics like pepperoni, white mushroom, and margherita, you truly cannot go wrong. They primarily serve lunch to workers on weekdays, so either go then or for their dinner hours on Thursdays and Fridays (hours as of June 2022).\n",
    "Howlin' Ray's": "Howlin' Ray's is of the pioneers who brought the hot chicken craze to California, and there is certainly a reason why they helped boost this sandwich's popularity so much. The sandwich is perfectly spiced and balanced, and it's hard to find competitors for this spicy sandwich giant even though new ones seem to pop up every day.\n",
    "Mastro's Steakhouse": "Of all the steakhouses that come through LA, Mastro's has always been my favorite. From the sushi, to the perfectly cooked steak (get ribeye/tomahawk ribeye pls you'll thank me later), and finishing with the buttercake, it is hard to find a more satisfying celebratory meal than Mastro's. I must reemphasize getting the buttercake as dessert. This is one of my favorite desserts to ever exist it is the most deeply favored, moist, and crunchy cake and I cannot recommend it enough. Do not skip this.\n",
    "Rossoblu": "One of the premier Italian restaurants in LA, Rossoblu does a great job doing the simple things right. Their pastas are phenomenal, some of the best in LA; my favorites are the tagliatelle al ragu and the tortellini al brodo. However, starters like the tuna tartare and lemon brocollini are exquisite as well. If you are looking for higher end Italian cuisine in LA, look no further than Rossoblu.\n",
    "AOC": "AOC introduced one of my all time favorite dishes to the world: the bacon wrapped date with parmesan cheese. However, this is not where their stellar food ends. The fried chicken, salads, and every other dish I have tried has been exquisite and they foster a lovely environment for a perfect dinner.\n",
    "Bavel": "Bavel is a spin on Mediterranean food I didn't know I needed. The spreads are fabulous versions of the classics we all know and love; combined with innovative appetizers and deeply tasty entrees, it is such a lovely experience.\n",
    "Majordomo": "From beginning to end, Majordōmo is one of the best dining experiences I have ever had. Inspired by the multi-cultural landscape of California and cuisines across Asia, you can find innovative takes on many trendy and classic dishes alike. David Chang does a fabulous job of incorporating a slew of ingredients and techniques from across the world to make this concept come to life. Some of my favorites include the mushroom crispy rice, which is Chang's incredibly flavorful modern take on seafood nurungji, and grilled sriped bass fillet, topped with a ridiculously good fermented jalapeño sauce. \n",
    "Felix Trattoria": "If you’ve got money to burn, there aren’t many Italian places more worthy of burning it than Felix Trattoria. Their menu features incredible pastas from a variety of areas in Italy like the rigatoni all’amatriciana (Centro) and pappardelle bolognese (Nord), and iconic starters like the oft-imitated, never-replicated, squash blossoms. Felix is upscale Italian dining at its finest. \n",
    "margot": "Looking over the Culver City Platform, margot is a great place to get Mediterranean and Italian inspired dishes, presented in a modern American style. This is one of the few rooftop places I personally endorse (I'd say it's a 1/2 rooftop).\n",
    "HiPPO": "HiPPO takes the roots of Italian cuisine and scrubs contemporary Los Angeles into its pores. Their pastas range from light and bright to deep and meaty and the starters are a plethora of unique and delicious concepts. However, you cannot forget the proteins, which are adorned with the perfect pairings of toppings and sides, finishing the menu of amazing dishes.\n",
    "Sant'Olina": "When you walk out onto the rooftop of the Beverly Hilton, Sant'Onlina makes it a special place. Make sure to get at least one dip, which is paired with the most delightful warm Za'atar-covered bread. As the meal continues, you can go which ever direction you choose: a slew of delicious, light appetizers, meaty kebabs, or a big entree, surrounded by a medley of Mediterranean complements.\n",
    "etta": "You look through the menu at etta and its extraordinarily challenging to decide what to pick. Each category has at least four dishes I could see myself enjoying. Things I have enjoyed from the menu include the bubbling shrimp, little gem salad and orecchiette. However, I'm sure that wherever you go, it would be difficult to go wrong.\n",
    "Sushi Enya": "There are many sushi places in LA, many of them excellent in their own right. For me personally however, Sushi Enya is the best sushi experience I have had in LA. I highly recommend getting a reservation for a seat at the sushi bar- the ambiance is modern and chic, and you can watch the chefs make your sushi in front of your eyes! First, the fish is excellent. The sashimi is tender and fresh, and stays true to the flavor of the fish itself while the nigiri hits the balance between the fish and the rice just right. The classics like tuna, toro, salmon are of course a must have, but something a little out of the box that I highly suggest trying is the sweet shrimp— and don't forget to down the fried head on the side! I also recommend their more exotic rolls- you can't really go wrong with any of them, but I personally recommend the lemon roll and the yuzu roll.\n",
    "Damian": "Enrique Olivera flexes his culinary muscles with Damian. He reimagines staples of classic and modern Mexican cuisine into elegant, new, transformative dishes. First of all, the ambiance is modern and classy, and is a great place to have a sit down dinner. Of the things I tried, my highlights are the the fish tartare toastata, which was perfectly balanced in every form, the duck al pastor, a fantastic and innovative take on the popular taco filling, and pescado a la brasa (charred fish), which was one of the best seafood dishes I have truly ever eaten. Damian also serves most dishes accompanied with freshly made corn tortillas that bring them together. Damian brings something unique to the LA Mexican food scene- something that is both reminiscent and brand new wrapped in one.\n",
    "Antico Nuovo": "Beverly Boulevard on the edge of KTown might not be the place you’d expect for a taste of the Italian countryside, but that’s just the goal of Antico Nuovo. Your meal begins with rustic starters and a helping of fresh-made and highly addicting focaccia, before transitioning into heavier pasta and meat dishes, ingrained with traditional Italian spices and recipes, executed with all the richness and panache of Italian countryside cooking.\n",
    "Bestia": "Bestia is a titan of the LA restaurant scene. They have been serving the new-style modern Italian food that everyone lines up for for years now. My favorite on the menu is the roasted bone marrow, that is scooped onto a plate of spinach gnocchi. Truly cannot get any better than that.\n",
    "Mariscos Jalisco": "Of all the seafood tacos in LA, Mariscos Jalisco does it best with their famous crispy shrimp taco topped with avocado and a fantastic red salsa. However, don't pass up their other tostadas or cocteles as those also certainly pass the test as well.\n",
    "Pa Ord Noodle": "Pa Ord is my personal go-to Thai restaurant in Los Angeles. Pad Thai, Pad See Ew, Tom Kha, Panang Curry,  extraordinarily well. Don't forget to order a side of sticky rice instead of regular steamed! That's my favorite :).\n",
    "Tacos La Guera": "For around 4 months, I was lucky enough to have lived a single block from the Tacos La Guera Koreatown location. However, this wasn't a place I went out of pure convenience. They do tacos, quesadillas, burritos, and much more with extraordinarily flavorful meats such as al pastor and carne asada. However, their most famous is the suadero, which is a Mexican-style leg meat; the comparable European dish of this part of the animal is osso buco. It is unlike anything I have had before and unbelievably tasty, I go just for this on occasion.\n",
    "Roscoe's Chicken and Waffles": "Everyone loves Snoop Dogg, but usually not for the same reason as me: because he revived the famous Roscoe's Chicken and Waffles restaurants from bankrupcy. This place is a true classic and for good reason; they have some of the best chicken and waffles in the city. My go-to is the Obama special, three pieces of salty fried chicken topped on a sweet waffle, renamed when he ordered it there. Obama knows best.\n",
    "Tacos y Birria la Unica": "In the LA birria scene, there are only a few big names. La Unica is definitely one of them. Sitting right outside downtown in Boyle Heights, Tacos y Birria la Unica quietly serves some of the best birria in the city out of their ombre truck. If you have a friend who doesn't like birria though, don't worry as they have other delicious meats too.\n",
    "Mizlala": "Mizlala is home to the best brussels sprout dish on the planet and I will never stand down from this opinion. Mizlala brussel sprouts are crisped to perfection and coated with a sweet and salty glaze that pair with the flavor of the vegetable perfectly. Their chicken shewarma plate is also fantastic, and has juicy chicken imbued with great flavor. There are actually two locations for Mizlala: Mid City and Valley locations. The Mid City location is more casual and has great Israeli comfort food on a beautiful patio, while The Valley location is more sit-down and has a variety of Mediterranean dishes. If you are in The Valley location, do not miss the Moroccan Fried Chicken; it is addicting.\n",
    "Biriyani Kabob House": "Biriyani Kabob House should be on everyone's radar as not only a great place to get Indian/Bangladeshi food, but also a place to get affordable late night food. They truly do it all and they do it well. As their name suggests, their kebabs are delicious. Their curry based dishes as well as their wide variety of vegetable dishes are extraordinarily flavorful. Biriyani Kabob House is a cheat code tbh I don't know how they do it.\n",
    "Jerusalem Chicken": "Jerusalem Chicken brings Palestinean-inspired roast chicken to the forefront. The chicken has a great garlicy and crispy outside while being deliciously juicy on the inside. It's not just chicken though, their sides are just as good, so be sure to get a plate where you can get the best of everything.\n",
    "Pardis": "Pardis is the best Persian restaurant I have visited in LA. The ghormeh sabzi and fesenjun stews had intense flavor and paired perfectly with sides like tahdig and laffa. Later in the meal, the kebabs were cooked and spiced wonderfully, and rounded out this amazing experience. I suggest going with three or more because there are big portions, or be ready to eat with two.\n",
    "Tire Shop Taqueria": "A dollop of guacamole and salsa on top of a juicy meat pile wrapped in tortilla goodness... Is there anything better? The aptly named Tire Shop Taqueria makes these creations with utmost care. Their chicken, al pastor, and chorizo are all ridiculous, and my favorite ways to get them are in the form of tacos, quesadillas, or vampiros. It is one of my favorite taco stands in LA and it really doesn't get much better than this.\n",
    "Holbox": "In the Mercado La Paloma next to its sister restaurant, Chichen Itza, Holbox is an island of fantastic seafood. Every dish is incredibly fresh and jam-packed with perfectly balanced flavor with a Latino flair. The ceviche is fresh and incredibly well balanced with a combination of tart and umami flavors. However, the star of the show is the shrimp aguachile, as it had the freshest and creamiest shrimp I have ever tasted, combined with the sauce which was incredibly fresh and had a pleasant kick of spice. I would highly recommend Holbox if you are looking for amazingly fresh seafood with a burst of flavor!\n",
    "Chichen Itza": "The sister restaurant to Holbox inside the Mercado La Paloma, Chichen Itza is a monument to Yucatan culture and food. From stews to soups, tortas and more, Chichen Itza will not let you down and is dedicated to serving authentic, crave-worthy food right to your plate.\n",
    "La Pupusa Urban Eatery": "I love pupusas. They're like the little cousin of quesadillas that deserve more love. La Pupusa Urban Eatery is trying to make that come true. They have a myriad of traditional pupusa flavors, each better than the last. However, don't sleep on their experiemental premium pupusas which come with a range of ridiculously good toppings that can change a pupusa from delicious to extraordinary.\n",
    "Tacos Los Guichos": "A taco truck in a tire shop next to the freeway... does it get any more classic than this? Tacos Los Guichos serves up some fantastic, classic tacos. My favorites are the al pastor and asada, but I'm sure that any which way you go will be a treat.\n",
    "Mian": "If you like spice and noodles, Mian is the place for you. The main attraction is the Chengdu Zajiang Noodle, which has a mild spice but kicks up the numbing to make a very balanced, savory noodle dish. My other favorite is the Spicy Beef Soup Noodles, which is more on the spicy side and comes in a red broth topped with tender pieces of beef. Mian is one of my go-tos for Sichuan and noodles and it should be for you too.\n",
    "Tacos Tamix": "Tacos Tamix is great if you're looking for a classic taco truck. They serve up some great meats and tortillas and are perfect for a late night snack. I usually either go with tacos or a burrito here, but their options range from tortas to quesadillas as well. You can’t go wrong with Tamix; they do pretty much everything and do it well.\n",
    "Phillipe The Original": "Phillipe is a true LA classic. Whether it's before a Dodger game or just a casual meal, their French Dip is unrivaled in cost, convenience, and most importantly, deliciousness. I usually go with the lamb double dipped with swiss, but I've tried most of their other options and you really cannot go wrong. Make sure to try their famous mustard which will have your nose a bit firey, but it has incredible flavor. Also, don't get a wet dip unless you know what you're doing ahaha.\n",
    "B Sweet Dessert Bar": "If you’re craving something sweet in the midst of Sawtelle Japantown, don’t look further than B Sweet Dessert Bar. Bring a group and a hungry stomach for their delectable homemade desserts, including a “sluttiest” slutty brownie and more varieties of bread pudding than you thought possible. These specialties are rich, filling and largely portioned, so don’t shy away from sharing. I personally recommend the salted caramel bread pudding with a side of ice cream.\n",
    "Cool Haus": "Cool Haus has been a Culver City staple for years now, and with good reason. As well as serving up some of the best cookies and ice cream in the city, they fuse the two with delicious ice cream sandwich combos. If celebrating an occasion or eating a group, their ice cream pies (using cookies as crust) are not to be missed. \n",
    "Nickel Diner": "Nickel Diner serves up some of the meanest, classic breakfast and lunch food in DTLA. It's rare to find diners these days, and Nickel Diner executes on this niche perfectly. However, one of the (not so secret) secrets of Nickel Diner are their donuts. My favorites are the coffee and maple bacon, but each flavor always looks sooooo good coming by.\n",
    "Compartes": "If you're looking for a nice gift or want to go to a *fancy* place to get desserts, Compartes makes some of the best high-end chocolates in LA. Their truffles taste as good as they look, and their chocolate bars are sticks of goodness. I always remember the gifts I get from Compartes, even if they last only two days...\n",
    "Bumsan": "Korean-inspired ice cream shop Bumsan swirls some of the best soft serve in town. They have a great variety of flavors, cones, and swirls to make a perfect dessert experience. My go-to is the milk-matcha swirl on top of an oreo-dusted cone; a lovely balance of flavors that gives a perfectly sweet ending to my day.\n",
    "Van Leeuwen": "Van Leeuwen is one of my favorite ice cream shops. They have fantastic flavors like brown sugar chunk and my favorite, fresh mint chip. Definitely stop by for a cold sweet treat after dinner wherever you are in LA.\n",
    "SomiSomi": "SomiSomi has exploded in popularity in the past couple years, and for good reason. Their tayaki cones are delicious and have addicting fillings, while they soft serve ice creams are just as delightful. My favorites are red bean, matcha, and ube!\n",
    "Honeymee": "If you want to save the bees and love ice cream, Honeymee is for you. They have a variety of fantastic vanilla and matcha flavors, topped with a perfect drizzling of honey. However, one of my other favorites is the chocolate, which is also a bit salty and creates a lovely salty sweet combo.\n",
    "Midori Matcha": "Using matcha grown in Japan, Midori Matcha serves up some of the best green drinks and ice cream in the city. They are incredibly flavorful and the ice cream has an light powdering of matcha on top, creating an intense and delicious matcha experience.\n",
    "Phoenix Bakery": "My grandma used to be a judge who worked all the way in Downtown although her family lived in Northridge. For my moms birthday every year, after work she would bring her back the strawberry short cake from Phoenix Bakery; this was 40 years ago. To this day, this cake holds up and is stellar. If you like nuts, definitely get the almonds on the side, but if not it is just as great without.\n",
    "Mumu Bakery": "Mumu Bakery is one of the cutest and most delicious bakeries I've visited in LA. They have croissant taiyaki with a variety of delightful fillings, different flavors of madelines, and many other wonderful asian baked goods. Their drinks are also designed so adorably and are equally as yummy: they're great for a surprise or gift!\n",
    "Sul and Beans": "When I had Sul and Beans for the first time, my life changed forever. I hate shaved ice. Sorry if that's a hot take. Sul and Beans is not regular shaved ice though; their bingsoos are made up of finely shaved milk that melts in your mouth, topped with your choice of powder that is layered in the bowl throughout. To top it off, there is a scoop of red bean and condensed milk that finishes one of my favorite desserts in the world. There is a reason this place is constantly incredibly busy.\n",
    "Tiger Sugar": "Tiger Sugar elevates milk tea to a new level with their house made brown sugar syrup and their chewy boba. Their signature drinks feature a cream mousse, which gives the drink a much needed creamy and sweet-salty topping. I usually get the #3, black sugar boba + pearl milk cream mousse. It not only has normal sized boba, but also smaller pearls which makes a fun texture experience for the drinker.\n",
    "Ding Tea": "Ding Tea is my personal favorite boba shop. Their signature, oolong, taro, and thai teas are all excellent, and they have ice + sugar level customization for all drinks. If this was it, I would still be happy; however, they also have amazing yakult drinks as well, something I cannot find in many places around LA. My personal favorites are the mango and grapefruit!\n",
    "Volcano Tea House": "One of the OG boba places in LA, Volcano Tea, still makes some of the best. They have a wide variety of delicious milk teas, but I usually keep it simple with the oolong milk tea with boba. Sawtelle is a difficult area to choose your dessert, but Volcano is a great option for the boba lovers out there.\n",
    "Wanderlust Creamery": "Wanderlust Creamery is the perfect place to visit for those who want to taste their way around the globe...on a budget. All of their flavors are inspired by places around the world and breathe new life into the traditional boring and tired ice cream flavors. My personal favorites are their famous Ube Malted Crunch, Passionfruit Cacao, and Japanese Neopolitan. I'm honestly not a fan of ice cream and consider it to be a C tier dessert, but I will make an exception for Wanderlust. -J. *Editor’s note* There will be retribution for Jenny’s slander of ice cream, but it does exemplify how good Wanderlust really is.\n",
    "Tea Master Matcha Cafe": "Tea Master Matcha Cafe lives up to its name. Their drinks and ice cream are extremely flavorful, and they use matcha powder sourced from Japan. You can buy a variety of matcha products in their store, talk to employees, or just come to get some of the best matcha drinks and soft serve in the city.\n",
    "Millet Crepe": "Millet Crepe blew up on TikTok, and while I was initially skeptical, I admit that it was for good reason. Their famous crème brûlée crepe not only looks ridiculously good, but tastes amazing. A thin crepe is wrapped around a thick block of crème brûlée filling, and the top is torched to create the burnt sugar top. If you like crepes, this is a great take on the classic French dish and will make you question dessert as a whole.\n",
    "Zooies": "LA gas prices got you down? Find a sweet pick-me-up inside United Oil’s We Got It! Mart. I’m quite serious when I say that some of Los Angeles’ very best cookies can be found behind the counter of a gas station marketplace. You can’t go wrong with any of their freshmade creations, but I recommend the panda(oreo), mooie(pretzel and chocolate chip), snickerdoodle, or any of their four(!) variants of chocolate chip. On top of that, their lemon bars are perfectly tart and textured. After a few bites of zooies, you’ll be emptying your tank just for an excuse to go back. \n",
    "The Pie Hole": "The Pie Hole is dedicated to making some of the best pies in LA. They have sweet apple, deep chocolate, tart key lime, and my personal favorite and best seller, earl grey. It's a great place to get dessert in the Arts District, especially if you're craving some flavorful, buttery goodness.\n",
    "Sidecar Doughnuts & Coffee": "Sidecar is where doughnuts go from an unhealthy breakfast to an unhealthy gourmet experience. Their doughnuts have perfect texture throughout, and some of my favorite flavors include huckleberry, maple bacon and saigon cinnamon. Don't miss out on this place if you like doughnuts, it's a great experience.\n",
    "The Bigg Chill": "When Demi Lovato roasted The Bigg Chill a couple years ago, she was effectively cancelled in West LA circles. This place has a cult following and it's understandable why. Their signature froyo, the Chill Berry, is their take on the classic tart flavor and it's uniquely delicious compared to others. While they are not titularly named, their other flavors do not drop in quality as well. To make the most bang out of your buck, what I do is share large portions with friends and get toppings on the side to get much more. You'll thank me later.\n",
    "Go Greek": "Go Greek takes frozen yogurt to a new level. Their froyo actually tastes like a combination of the classic we are all used to with the tartness of regular greek yogurt injected in. They have a variety of great flavors and toppings, ranging from classic desserty to healthy and bright.\n",
    "Jeni's Splendid Ice Creams": "Jeni's Splendid Ice Creams doesn't live down from its boastful (yet deserved) name. They scoop some of the best in LA, and their best flavors usually include some sort of dichotomous relationship like salty and sweet, fruity and creamy, or smooth and crunchy. It is this that sets them apart and creates interesting heterogenous flavors that will keep your tongue guessing with every bite. My favorites are the brambleberry crisp, brown butter almond brittle, and salted peanut butter with chocolate flecks, and did I say BRAMBLEBERRY CRISP, but there are so many more delicious ones on top of that.\n",
    "McConnell's Fine Ice Creams": "Hailing from Santa Barbara, McConnell's is an ice cream paradise. They have extraordinary, unique flavors made from high quality ingredients. My favorites are the eureka lemon & marionberries, mint chip, and sea salt cream and cookies, although most flavors that I tasted were very good as well.\n",
    "Pho 79": "LA county just doesn't have very good pho⁠— it's very sad. However, just a short drive away is Phở 79, a haven for Vietnamese food in SoCal. The pho broth is incredibly flavorful, and the toppings provided add such a punch to an already incredible dish. In addition, their side dishes are also fabulous like their curry chicken and egg rolls. Highly recommend stopping by ⁠Phở 79 if you are in the area to get some of the best Vietnamese soup around.\n",
    "La Super Birria": "La Super Birria has some of the best Mexican food I have had in Orange County. They have birria comparable to Los Angeles and you cannot go wrong with their variety of wrappings for this delicious, juicy, pulled meat.\n",
    "Rye Goods": "Did you know that Rye is very important for our fields? It replentishes the soil with the nutrients it needs for the next batch of nutrient-hungry crops. However, that is not the best reason to support Rye Goods. They have incredible pastries and breads unlike I have ever seen before. Their croissant was savory, yet light and crispy and was unlike anything I have ever had before. There were so many things in the case that I could not get, but desperately wished I could. There is always a short line here at Rye Goods and that is for a reason.\n",
    "Teddy's Red Tacos": "If you look up the LA Times video-article on Teddy's Red Tacos, you can actually see me in the background enjoying one of my favorite tacos of all time. They have exploded from a truck on Slauson Ave. to nine locations across Southern California, and absolutely deserve it. Their birria is so flavorful, and the way they dip their tortillas makes a world of difference. I highly suggest getting the deluxe plate, which allows you to try all their forms of birria deliciousness. Additionally, ensure you are dipping them into the consomé, which is the strongly flavored broth the birria is cooking in. That is a combo that will not be forgotten.\n",
    "Kinn": "Kinn was a life-changing meal. They take traditional Korean dishes and put their own little spin on it. I could talk extensively about literally every course I had that night, but my favorite part was the gyeranjjim, which was adorned with clam, mushrooms, and crispy spinach. Although it sounds mundane, it was one of the most exquisite combination of flavors I have ever experienced, and I could say that about every course I had. This was in May 2022, and their menu changed often so it is possible that they do not have this dish anymore. However, I would be shocked if their new items do not live up to the consistent quality I experienced that night.\n",
    "Xiang La Hui": "Xiang La Hui is one of my favorite Sichuanese restaurants in LA. Their dishes perfectly showcase the balance between the spice and numbness, or the Ma La flavor profile. My favorite dishes there include the toothpick lamb, mapo tofu, and the fish in spicy hot pot, but I would go back just for the toothpick lamb; I find myself craving it at strange times.\n",
    "Noodle Harmony": "Noodle Harmony is a great place to get spicy Chinese noodles. They're most well known for their dan dan and signature beef noodles, but they have a wide variety of mouth-watering selections.\n",
    "Mama Lu's Dumpling House": "Mama Lu's has some of the best dumplings around. Starting with the xiao long bao and spicy wontons, the meal only gets better with their fantastic menu of Chinese classics. Every dumpling I have tried there has been phenomenal, and you can't go wrong ordering a big selection from Mama Lu's.\n",
    "Mason's Dumpling Shop": "Mason's has a large seletion of incredible dumplings, ranging from boiled to steamed and pan fried. The fillings are incredibly delicious and you cannot go wrong with anything you order here. In addition to the dumplings, their buns are also very good and Mason's does a great job of putting out a high-quality product that is made fresh every day.\n",
    "Yang's Kitchen": "Yang's Kitchen occupies an incredibly interesting niche: chinese brunch food. Their cold noodles, braised rice, and mochi pancake are all highlights, but I have heard that most things on the menu are incredibly good, including the pastries!\n",
    "Lunasia Dim Sum House": "From the har gao, to the siu mai and the BBQ pork buns, Lunasia is one of my favorite places in LA to go for dim sum. They are especially known for their dim sum made with rice-made wrappings, so make sure you get the har gao and noodle rolls!\n",
    "Chongqing Special Noodles": "Chongqing Special Noodles specializes in their wide selection of Sichuan inspired noodles. The dan dan, biang biang, and Chongqing hand pulled noodles are all stand outs, but what separates it from the rest is the fact that some menu items use hand pulled noodles. These noodles have a perfect chewy bite and are truly hand-pulled so every one looks and feels different. Chongqing's noodle experience is like none other and if you are a noodle afficionado, this should definitely be on your list to try out.\n",
    "Sichuan Impression": "Sichuan Impression does so many dishes well. The tea smoked ribs, mapo tofu and cold chicken are all bursting with flavor and are my personal favorites. If you like spicy or Sichuan food and have never been here before, I have no doubt that this restaurant will leave you with a fantastic first impression.\n",
    "Slurpin' Ramen": "Slurpin' makes great ramen at a great price point. It's creamy, rich, and if you want, flavorfully spicy. They have an assortment of toppings to choose from, from an egg to extra meat, shiitake mushroom and corn. It's a great place to come to casually with friends and will leave you feeling warm and soulful inside.\n",
    "Twozone Chicken": "Twozone chicken takes classic American fried chicken and sauces it up with Korean-inspired glazes. They have spicy soy, soy garlic, gochujang, and much more. I've tried most of their options and can say all that I've tried are quite delicious. Definitely head down if you're looking to mix up your classic chicken experience; you won't regret it.\n",
    "Surawon Tofu House": "Surawon is BCD but better (sorry to all the hardcore BCD fans). To start, their banchan are excellent, highlights including the fish cakes and the two types of tofu they make in house everyday. Then, comes the soondubu and combo options: soondubu is a silken tofu soup that is filled with meats and seafood which comes in a hot dolsot pot (stone pot), bubbling straight from the stove. If you are new to soondubu, I would recommend trying the mixed soup; this is their most popular option and comes with both meat and seafood. If you are looking for something more experimental, I would try the fish roe soondubu (a personal favorite). I highly recommend trying out Surawon if you like BCD, spicy food, or Korean food; it will make you want to come right back! -J\n",
    "Michin Dak": "Michin Dak, or crazy chicken, does a great job of injecting Korean soul into a classic American fried chicken sandwich. Their sandwich has a fantastic seasoning, able to be adjusted to your spice preference, and is topped with creamy cole slaw and balancing pickles. Their fries are also perfectly cooked and seasoned, completing an awesome Korean-American experience.\n",
    "88 Hotdog": "“What’s a Korean corndog?” you might be asking, as I did upon discovering 88Hotdog. It turns out that Korean corndogs differentiate themselves from our American variants thanks to two twists. First, the middle of the corndog can be customized, offering cheese, meat, or a combination of both. Second,you can choose to embed little pieces of potato in the corndog batter before frying, creating a batter-meets-french-fries exterior thoroughly distinct from any corndog you’ve had before. Lastly, the corndog can be topped with a sugar coating and served with ketchup, mustard, or sweet chili sauce. This will change your perspective on corndogs forever and make you wonder why this hadn't been invented sooner. \n",
    "La Cevicheria": "This Guatemalan / Peruvian / Latino seafood restaurant is what every seafood lover should crave. Not only are the prices cheaper than pretty much any seafood restaurant around, but the quality matches or exceeds these options as La Cevicheria was recognized by Michelin as a Bib Gourmand selection in 2019. Their mouthwatering selections include the aguachiles, chapin ceviche (which is not seen in many other places around LA), and tostadas, all of which will make you wanting more.\n",
    "Dave's Hot Chicken": "Started in an East Hollywood parking lot, Dave's has gone from a humble stand to a massive franchise and brand name chicken restaurant. While that usually stops me from putting them on a list like this, I've watched Dave's grow into the behemoth it has become and still have a soft spot for them as their quality has not deteriorated whatsoever (at least at the locations that I visit). The chicken that they serve is not only spiced perfectly, but it is legitimately soft and incredibly juicy. You can't go wrong with any of their combos, but know that the spicier you get, the more flavorful the chicken's exterior will be— so go for it, but beware.\n",
    "hanchic.": "Hanchic takes traditional Korean cuisine and throws it all out the window. Aggressively. Normally, I would say that is a bad thing, but hanchic has found a way to successfully incorporate cuisines across the world into their Korean selection, creating fusions dishes that will literally make you say WTF when seeing them written, but speechess when eaten. My favorites include the iconic bulgogi risotto, hoe buns, and dubbap rice bowl. However, I am fiending to go back and try more to see what else hanchic has to blow my mind next. As much as I do like hanchic, I would like to give a slight warning to individuals expecting more traditional Korean cuisine: do not go here if you want that or have guests that expect that. They may be overwhelmed LOL.\n",
    "Hae Jang Chon": "Hae Jang Chon is a Koreatown favorite for AYCE kbbq. To be transparent, they are a bit more expensive than the other places I wrote about here BUT has incredible quality and variety. I would highly recommend both their marinated and unmarinated short rib and their USDA Prime Steak. Hae Jang Chon also grills its meat on the more traditional hot rock as opposed to the more common metal grill. If you are looking for AYCE + good quality meat, Hae Jang Chon is the place to go! -J\n",
    "Man Soo Korean BBQ": "If you like AYCE Korean BBQ and you are partial to marinated meats, I would highly recommend Man Soo. Man Soo is a reasonably priced AYCE, and has a variety of options given the relatively cheap price. I highly recommend their marinated beef short plate, which has thinly sliced beef that is marinated in a light soy sauce based marinade. If you like bulgogi or LA galbi, you will love this dish. Man Soo also used to have a cold bar with various side dishes and sauces, but has stopped since the pandemic- maybe they will bring it back soon? A great place to go and have a KBBQ night with friends 😊 -J\n",
    "Meat Love Korean BBQ": "As the name implies, Meat Love is for TRUE lovers of meat. Their collection is reasonably priced and offers a surprising variety of meat given the cost. Some items that you can get on the Meat Love basic menu that is not common everywhere else include intestines, rib finger, and pork rind. If you are not feeling experimental, their basics are still good quality and delicious. They also have amazing side salads- try the green onion salad for pork and the onion salad for beef! Meat Love is THE kbbq place I recommend for going out with friends. They are accommodating of large parties, outside, and relatively affordable. -J\n",
    "mdk noodles": "A meal at mdk starts with two of their well known kimchis. The white, which is acidic and pungent, and the red, which is spicy, fresh, and has hints of pepper and garlic. However, next comes the main attraction: the soups. My favorites are the spicy arrowhead noodles with skate and the chicken noodle soup. The green arrowhead noodles are perfectly cooked with a thick, red, savory sauce coating each one. The chicken noodle soup is like a variation on the American version, but frankly better. The broth is packed with flavor and the knife-cut noodles have a great bite. It is filled with delicious dumplings and topped with ground pork and veggies, making it my favorite sickness cure in LA. I used it to get over covid (delivery ofc)!\n",
    "Isaan Station Thai Street Food": "Isaan Station occupies a niche that most Thai restaurants do not cover: Northern Thai and Thai street food. Make sure to get the papaya salad topped with pickled blue crab and other delicacies you cannot find elsewhere in LA. \n",
    "Saikai Ramen": "Saikai is one of my favorite ramen places in LA. This place is CRIMINALLY overlooked in just about every way as they prepare some of the deepest, most flavorful broths I have ever tasted. Their spicy shoyu tonkotsu is to die for and has a plethora of delightful toppings that adorn their addicting broth. They gyukotsu is also phenomenal, and is basically a representation of umami in a bowl. However, for your first time there I highly recommend trying the spicy shoyu tonkotsu as it will certainly have you coming back again and again.\n",
    "Kobawoo House": "Bossam is a Korean dish that many Americans probably have not heard of before. It is spiced, boiled, then sliced pork shoulder, served with an assortment of side dishes. Kobawoo House is known worldwide for their bossam, and they serve their pork with sides of cabbage, pickled daikon, radish kimchi, and salt fermented shrimp. Assemble all of these things together and you have a lettuce-wrapped sandwich that will rock your entire world. It is the perfect balance of saltiness, fat, acidity, vegetables, and meat and when I went for the first time I was shocked that a place this good had been sitting under my nose for years. Kobawoo House serves one of my favorite dishes ever and I highly recommend stopping by and trying bossam for the first time if you have never had it before.\n",
    "Myung In Dumplings": "People typically associate dumplings with Chinese food, but Myung In will change that. Their Korean meat-filled pockets of goodness are truly unbelievable. I believe at this point I have tried every single dumpling on the menu and I can fairly say they are all extraordinarily good. My favorites are the pork and kimchi bun, which has a slight kimchi flavor that really elevates the dish, the pork and shrimp steam roll dumpling, which comes with a delicious spicy sauce, and the shrimp, pork, and vegetables fried dumpling, which adds a lovely crunch to the equation. Make sure to use a lot of their addicting sauce and I always end up asking for extra banchan because their pickled radishes are that good.\n",
    "Guelaguetza": "The url to visit Guelaguetza's website is ilovemole.com. After visiting their restaurant, I couldn't agree more. Their red and black moles are unlike anything I have had before in LA. The chocolate sauces are perfectly balanced between savory and sweet, and go well with just about anything you put on them: enchiladas, chicken, steak, or chips. If you've never had mole before, go out and try it at Guelaguetza. If you have, go out and try it at Guelaguetza. It will give you perspective on how good this dish can be and there is a reason they are famous across North America.\n",
    "Dan Sung Sa": "Dan Sung Sa was created to mimic Korean bars in the 1980s. It is fully outfitted with classic wooden tables and chairs, walls graffitied with the signatures of customers, and a skewer grill in the middle. You can choose to eat a full meal here, but I would recommend you get a large variety of freshly grilled skewers. The skewers are small but range from around to one to three dollars a skewer so you can try a couple different kinds! Regarding alcohol, I would recommend YoJu (yogurt soju). Even though the ambience and the food is fantastic here, unfortunately the owner is a bit unscrupulous. Make sure to clearly count your orders and write it down, or she may overcharge you. -J\n",
    "Park's BBQ": "Park’s is a Koreatown classic when it comes to KBBQ. Park’s is quite pricey, but the price is justified by using high quality meat and providing a high class KBBQ experience. If you want to give it a try without committing to the cost, I would try the lunch menu, where you can try some of their other dishes that are quite delicious for a fraction of the cost. The side dishes there are also notable in itself- possibly the best I have had in Koreatown! -J\n",
    "Han Bat Shul Lung Tang": "Are you looking for a bowl of warm soup to warm up your frosty heart? If so, (or you just want some bone broth), make sure to go to Han Bat Shul Lung Tang. Shul Lung Tang is a traditional Korean soup that is made by boiling ox bones for a very long time, and is served with boiled meat, kimchi, and rice. The flavor is a bit difficult to describe, but it is one of my all-time favorite places to go to for its rich and hot soup. If you are tired of going to kbbq, give Han Bat Shul Lung Tang a try! -J\n",
    "Kogi": "Chef Roy Choi, a food truck and Asian Fusion pioneer, probably needs no introduction. His passion project, Kogi, already feels like a Los Angeles staple. A terrific and surprising blend of Mexican street food and Korean barbeque, his short rib tacos and burritos are what give Kogi its fame. However, don’t let one of the menu’s hidden gems pass you by: the PacMan quesadilla. This monstrosity combines all of the truck’s available meats, cheeses and signature salsas into the single greatest quesadilla ever constructed. \n",
    "Tilt Coffee": "If you are looking to impress even the most ardent coffee haters, Tilt Coffee absolutely is the place for you. They are known for their cloud lattes, which are creamy and foamy lattes that retain their “cloudy” texture even when cold. I would highly recommend the original iced cloud latte or their iced matcha cloud. They are a bit hard to find as they are in the courtyard area of an apartment complex, but the slight search is undoubtably worth it. If my personal endorsement is not enough, check Yelp- 5 stars from 500 people. My personal favorite coffee place in LA! -J\n",
    "Bohemian House of Espresso + Chai": "This is one of the cutest spots in LA to grab a cup of coffee and study for finals. The owner of the shop is so friendly and welcoming and always encourages USC students to study at his shop. There are plenty of chargers for your electronic devices, so you can study here for a long time. As the name implies, they have excellent chai and tea, and I would personally recommend their dirty chai latte. Bohemian House of Espresso and Chai uses real toasted spices to make their chai and does not use concentrate like most places. -J\n",
    "The Varnish": "The Varnish is THE bar I recommend to anyone trying to find a bar with good drinks in LA. The Varnish has speakeasy vibes and is a great place to go if you are trying to try good drinks and sit down with your group- if you are looking to dance, I would not recommend! My favorite drink at the Varnish is the bartender’s choice because the bartenders will craft a drink based on your favorite flavors. This lets you guarantee that you will like your drink as well as lets you try something new! Could not recommend enough, and this is coming from someone who borders on hating alcohol! -J\n",
    "Death & Co.": "This is a cute little spot that is located squarely in the Arts District, which makes it a tempting option for post-dinner drinks. Death & Co has great energy- the music is loud but not annoying, and the atmosphere is always lively. I personally loved their drinks, which are almost identical to the selection offered at their ICONIC New York location. The drink menu is thoughtfully crafted, with detailed descriptions and images to ensure that you will enjoy your drinks! Of course, the drinks are delightful. -J\n",
    "Alchemist Coffee Project": "This is a high contender for my favorite coffee spot in LA, just for their hot lattes and their matcha! I would personally recommend their hazelnut latte, which is the perfect mix of creamy, sweet, and bitter. If you are a matcha lover, I would recommend their mint matcha. The interior is so very cute and is a great spot to study as they have many outlets and tables. There is always a bit of a line here, which is a testament to how fantastic their coffee is. This is a great introduction to coffee and matcha but be careful as you may literally become addicted. -J\n",
    "The Wolves": "If you want to visit possibly the most beautiful bar in LA, The Wolves is the place for you. The Wolves is outfitted with black spiral staircases, a beautiful bar, and a gorgeous stained-glass ceiling. There are two levels so you can choose to stay downstairs to stay close to the bar or migrate upstairs for more privacy. The drinks here are solidly good- I would recommend Tiger’s Milk for a smoky and spicy flavor profile. Would highly recommend for the good drinks, immaculate vibes, and gorgeous place! -J\n",
    "The Thirsty Crow": "The Thirsty Crow is a very fun + cute spot located centrally in Silverlake on Sunset Blvd. I think it straddles the line between it being a regular bar and a dive bar. On specific days they have discounts for cheaper drinks, and their drinks are a tad bit cheaper than traditional LA prices, but I do not think it is quite a dive bar. The décor inside is very cute, and there are plenty of spots to sit down even though it is busy! I would recommend the whiskey sour- very foamy and has balanced flavors. Stop by if you are in Silverlake! -J\n",
    "Wushiland Boba": "If you are a boba lover, you must try Wushiland Boba! This is a fun boba store with a wide variety of teas and toppings. My personal favorite is the Oolong Milk Tea with BOTH regular and mini boba. A texture nightmare for some, but the mini boba adds a fun twist to the boba we all know and love. The boba balls are always perfectly chewy and never bloated, the tea is not too sweet, and the tea flavor comes in powerfully. Stop by Wushiland Boba if you are ever shopping at Century City Westfield- it will elevate your shopping experience. -J\n",
    "Hilltop Coffee + Kitchen": "If you are looking for a cool place to work and get some breakfast + coffee, I would recommend Hilltop Coffee + Kitchen! The interior is well lit and decorated and is a great place to catch up with a friend, read a book, or answer some emails. The coffee is on the stronger side (which I personally appreciate), and the taste of the coffee itself is quite good. Check it out if you are in the area! -J\n",
    "Lodge Bread Co.": "Bread is the operative word in Lodge Bread co.’s name. Their loaves can more-than stand on their own, with options ranging seeded country loaf to fresh sourdough. But Lodge is no simple bakery: they offer hearty comfort options from filling sandwiches to hearty avocado toast, complete with a fried egg on top. However, the highlight of their menu is shakshuka, an Israeli dish with a deep tomato flavor, a perfect balance of spices and toppings, and a fresh-baked slice of olive bread to bring it all together; I will repeat, this is not an ordinary shakshuka and I have not found anything REMOTELY close, so go order it. Now.\n",
    "Churros Don Abel": "If you like Disneyland churros, get ready to have them ruined for you forever. Even if you think you know what a churro should taste like, prepare to have your mind blown. These churros have shockingly crispy outsides, soft insides, and are coated with the perfect amount of sugar and cinnamon. You can also get a side of caramel sauce which some of my friends enjoy, but I personally enjoy the pure churro deliciousness itself. \n",
    "Pitchoun!": "Pitchoun! is a cute French bakery specializing in pastries and brunchy food. Their striped croissants look as good as they taste, and I'm sure their other pastries live up to this one. For my brunch, I ordered the croque madame, which was a fabulous version of the dish topped with just the right amount of bechamel and a perfectly done sunny side up egg. Their tartines also looked fabulous and are created with their artisan bread that I will certainly pick up on my next visit.\n",
    "Republique": "Republique is an LA powerhouse at this point. From the start of the day until the end they are packed and serving some of the most delicious food in the city. In the morning, some of the favorites are the brioche french toast and mushroom toast, while at the end of the day my highlight is the Cooks pasture raised chicken. In my opinion, this is a non-negotiable for diners going for dinner. This chicken has crispy, flavorful skin while being incredibly juicy on the inside and is surrounded by a medley of complementary vegetables that elevate the flavor of the chicken immensely. \n",
    "Yardbird": "Yardbird does high end fried chicken and southern cuisine. They have excellent mac and cheese, made from five tasty cheeses and crusted on top for a lovely texture difference. The main attraction however, is the chicken. This bird is treated like a queen. I'm not sure what magic they work back there, but the fried chicken with honey hot sauce, chicken and waffles, and hot sandwich are all phenomenal ways to enjoy this special chicken. It has an incredibly satisfying crust and flavor, while being extraordinarily succulent and juicy on the inside. It's very difficult to find a fried chicken prepared better than Yardbird.\n",
    "Jitlada": "Jitlada is known for their spicy Thai food, so BEWARE. Just kidding, it's customizable, but they still are known for that! If you go to Jitlada, stray away from your comfort zone in Pad Thai and try some of their most popular dishes- the classics will be essentially the same! Some of the highlights include the crispy morning glory salad, crying tiger beef, and Taepo chicken curry, but there are so many fabulous dishes to choose from that you likely have never heard of. Jitlada earned itself a Bib Gourmand recommendation from Michelin in 2019 and it was certainly well deserved.\n",
    "San Soo Dang": "San Soo Dang is one of LA’s finest stores for selling rice cakes. Korean rice cakes come in an incredible variety and range from sweet, and dessert-like to savory. For those who cannot decide which kind they like the best, San Soo Dang offers a very vast variety, and cannot be compared to the offerings at Korean markets. If you have never tried sweet rice cakes, I recommend you try their song-pyeon, which is a rice cake filled with honey and sesame filling. Just a word of caution- they are cash only and the employees speak limited English. However, if you want to try authentic rice cakes, don’t let that scare you and visit with a 20 dollar bill and google translate! -J\n",
    "Sweet Rose Creamery": "Sweet Rose has some of the finest ice creams in LA. Their fresh mint chip is something I find myself craving and it's so much better than any store bought version you will find. Additionally, their milk and cookies is a phenomenal version of the classic cookies and cream. They source all their ingredients from local farmers markets, and it certainly shows with the quality of the products they put out on a day to day basis.\n",
    "Wexler's Deli": "Wexler's is the only deli in Los Angeles that smokes and cures their meat in house. This is the basis for their two specialties, lox and pastrami. Their pastrami sandwiches rival any in LA and the lox is some of the freshest and best tasting I have ever had. I have heard up and down reviews on the freshness of the bagels themselves, but I have never had a problem personally. If you'd just like to cut that out, you can certainly just buy lox and take it home like you do at the supermarket and enjoy it at home.\n",
    "Lawry's The Prime Rib": "Lawry's has been around forever (1938, thats pretty much forever). They are so well known that you can find their steak seasoning in pretty much any supermarket around Los Angeles. This sort of recognition and endurance throughout the years doesn't come out of nothing. Lawry's has some of the best steak and service of any restaurant in LA. The meal starts with the delicious chips at the foyer, but make sure to not eat too many as you will be full for the main attraction. When it's time for that, the servers will come around with massive silver carts, ready to cut your prime rib right off the meat and onto your plate. If you really love the meal, you can go with the Diamond Jim Brady Cut, who was known for having a stomach 6 times the size of the average human. Actually, probably don't do that unless you want to die.\n",
    "Mulberry Street Pizzeria": "Mulberry St. is the original place that has served NY style pizza in LA for decades. Their pizzas are MASSIVE, and can easily feed 3-4 people each so they are great for parties. However, their size isn't their biggest selling point, it's the taste. The crust is thin and has a complex taste, while the cheese is perfectly melted and charred and the toppings they put are great as well. Some of their best options are the pepperoni, tomato and artichoke, and rigatoni. Yes, rigatoni. They have pasta pizza and it's great. Come for me. Lastly, don't forget to order the lorna luft chopped salad, which is stellar and one of my favorite chopped salads in LA.\n",
    "The Original Pantry Cafe": "When my grandfather and his father originally came to LA around the 50's, they worked in the produce market on 8th street (that's still there!). Every morning at 5 AM, they would go to The Original Pantry for breakfast before work. This diner has stood the test of time and is an LA icon today. Get your favorite American breakfast classics like french toast, eggs, and pancakes and enjoy an establishment that has been around since 1924.\n",
    "Yomie's Rice X Yogurt": "DISCLAIMER: This is not boba, but I literally could not think of another category to put it in sorry. When I had this drink for the first time I was shocked I had never had it before. The restaurant is aptly named: their specialty is a liquidy yogurt drink filled with purple rice. If you like frozen yogurt and yogurt in general, I can assure you that you will love this drink. It's a very interesting combination of tart, sweet, and savory and is a very popular drink in mainland China that is just starting to get traction here.\n",
    "Chimmelier": "Chimmelier is not only a brilliant take on fried chicken in general, but it is one of the best K-Fried Chicken places I have had in LA. I tried almost all of their flavors: my favorites were the OMFG, which was a sweet, tangy, and spicy gochujang sauce; the honey butter, which was a sweet and savory combo that worked perfectly with the chicken; the galbi, which was an interesting and delicious combination of KBBQ flavors with KChicken; and their Chimmelier signature spice rub, which I believe went best with the sandwich. However, I believe what sets Chimellier apart is the breading. This is some of the most flavorful, crispy breading I have ever eaten and it is worth coming here for this alone. You can order wings or a whole/half chicken, and I recommend popping off with a group of people to get a lot of insanely good chicken for a great price.\n",
    "Wuming Hot Pot": "Hotpot is a cooking method used across Asia that involves dipping a variety of items into flavored boiling liquid, then inserting them promptly into your salavating mouth. These items soak up the flavor of the liquid, and it has the taste of it, as well as the item itself (ranging from veggies, to tofu, to meat) as you eat it. At Wuming, they make delicious boiling liquid, flavored with either spice, numbness, tomato, mushroom, bone, or some lovely combination of these flavors: my favorite being the spicy butter broth base which is a combination of spicy and numbness. One of the fun items they can bring you is the beef \"wa wa\", which is a doll wrapped in a meat dress like Lady Gaga that you will quickly deconstruct and put in your mouth.\n",
    "AWAN": "Of the daily rotating group of flavors that were presented to me the day I went to AWAN, I tried the mocha oreo, lemongrass, and blood orange. I didn't even realize it at the time, but all of these flavors were not only extraordinarily flavorful and delicious, but they were also dairy free. AWAN, meaning cloud, is an ode to Indonesia, and is an ice cream shop that imports fresh ingredients all the way from the archipelagic nation to here. They use coconut milk, vanilla, and a host of other fresh ingredients to make some of the best overall, but certainly best vegan ice cream I have ever tried.\n",
    "Kabob by Faraj": "When you walk into Kabob by Faraj, there typically aren’t that many people eating there as most people are picking up kosher meat from the butchery or takeout bags to eat at home. However, Kabob by Faraj serves some mean kebab and other Persian delights in their space like gormeh sabzi, tahdig, and gondi. Typically, Persian food can get pretty expensive, but Kabob by Faraj always keeps prices cheap, so it is a great go-to casual spot if you’re craving kebab without breaking the bank.\n",
    "Hui Lau Shan": "Hui Lau Shan is a Hong Kong dessert shop dedicated to the world’s best fruit, mango. They have mango balls, cut up mango, mango pudding, mango sorbet, and more arranged in these delightful mango arrangements. If you get a combo, be sure to share it with a friend or love mango a lot because those are BIG. I wouldn’t blame you for eating the whole thing though because they are just that delicious. If you even somewhat like mango, I highly recommend trying Hui Lau Shan for one of their many mango-themed refreshing sweet treats.\n",
    "Lanzhou Noodle": "Lanzhou (LAN) noodle is a perfect spot for all kinds of noodle lovers. Their flavorings range from savory to spicy and they have eight, I repeat EIGHT, different types of house-made noodle. These span from angel hair thin noodle, to triangle noodle, and my personal favorite wide flat noodle. My go-to pairing is the spicy beef noodle soup with the wide flat noodle; the noodles have perfect bite and the soup is packed with spicy, meaty flavor. If you don’t live in SGV, it’s worth the trip. I do it!\n",
    "Mozza": "Where to start with Mozza… Nancy Silverton’s twin restaurants each offer a unique perspective and have practically defined Italian cuisine in Los Angeles. What they share is the bread; the starting olive oil bread is something that cannot be replicated and should not be skipped. There is a reason why Silverton’s La Brea Bakery is so prolific across Southern California, and Mozza takes her bread making skills to the next level to something borderline addicting. At the Pizzeria, the pies are perfect; my highlight is the mushroom, which my mom has said ruins all mushroom pizzas for the rest of her life. Additionally, this is where you can get the famous Mozza caprese. At Osteria, the pastas and meats are incredible and you truly cannot go wrong with anything on the menu. If you are looking for high-end Italian food in LA, pick your favorite of these two behemoths, they won’t disappoint.\n",
    "Mateo's Ice Cream & Fruit Bars": "If you’re looking for a refreshing sweet snack, look no further than Mateo’s. They are like a fruteria + ice cream parlor mixed in one; they have fresh fruits, fruit smoothies, fruit bars, and a case full of ice cream. My favorite fruit bar is the chili mango, filled with fresh mango and tajin, and I want to go back to try more and more. Not only are their products fantastic however, they are very well priced, especially compared to the rising prices of frozen treats around LA.\n",
    "Sapphire": "If you find yourself in Laguna Beach looking for a place to eat, look no further than Sapphire. They provide a fantastic all-around experience from your drink all the way to dessert with a peek of an ocean view peering through the buildings across the street. Some of my highlights include the brussels and Kurobuta pork belly, which was like a typical brussels and bacon dish on crack, and the salmon with couscous, perfectly citrusy and topped upon a bed of chewy, flavorful, Israeli pearl couscous. It can be hard to find good eats around some smaller areas like Laguna, but Sapphire is certainly a shining gem along the sea.\n",
    "The Normandie Club": "The Normandie Club is a fun place to go when you don't know what the vibes are for the night. If you want to be in a more relaxed and quiet environment, check out the outside patio. If you want to dance, look for the dance room that is open on weekends. If you just want to be in the bar environment, feel free to stay inside. Specifically, I really enjoyed their mint mojito- it was balanced and fresh, and they were not scared of using mint!\n",
    "YUP DDUK LA": "Self proclaimed as the spiciest brand in Korea, YUP DDUK LA is the place to go if you are looking to challenge your tastebuds. The classic item to order is the YUP DDUK, which is a mixture of rice cakes, fish cakes, sausages, and cabbage inside a sweet and spicy sauce topped with mozzerella cheese. The cheese cuts the spice to create a harmonious balance of heat and dairy. Additionally, definitely get a side of tuna mayo to help as well; it is delicious and gives your tastebuds a great break from the heat. Lastly, be sure to bring at least two friends as these dishes are huge. If you finish one yourself, I would be extremely impressed. -J\n",
    "Angel City Brewery": "Located in the heart of the Arts District, Angel City Brewery is a massive space filled with people ready to drink some of the best beer in Los Angeles. They have solid classics as well as wild options like avocado, kumquat, and ‘srirachelada’. If you want though, they are more than willing to turn pretty much any of their beers into a michelada, so definitely keep that in mind when you visit.\n",
    "Tempura House": "Sawtelle Japantown is famous citywide for its many delectable Japanese offerings, but one of the area’s oldest and most delicious spots is located away from the pedestrian-laden chaos of Sawtelle’s central strip-malls. Further North along the boulevard is Tempura House, a casual, simple spot that’s been in Los Angeles since 1949! Don’t let Tempura House’s humble exterior fool you - there’s a reason they’ve been around this long… If you’re looking for Japanese comfort staples like Katsu Curry or Katsu Don, this hidden gem won’t disappoint. \n",
    "Manhattan Beach Post": "The Manhattan Beach Post is a staple of the South Bay food scene. To start, it would be sacrilegious to not get the famous bacon cheddar buttermilk biscuits. These are famous for a reason; they’re buttery, delicate, and the extras provide a fantastic depth of flavor. Next, their salads are all lovely, from the heirloom tomato to the mixed gem and the pastas range from light and bright to heavy and savory. Lastly, if you are somehow still hungry, you can’t go wrong with any of their big proteins. When you look at the menu, it can be hard to choose what to get as it all sounds so good, but luckily the plates are all meant to share, which is great for getting tastes of many of their amazing dishes.\n",
    "Jus' Poke": "Sitting an ocean away from Oahu, Jus' Poke is a much needed refresher compared to the sushi-reminiscent poke we usually have here in Los Angeles. There is no corn, carrots or bamboo shoots, to be found here; jus' authentic poke. They have eight different varieties, from spicy mayo, to wasabi shoyu, and hawaiian chili peppah, all are delicious in their own right. The sides are also fantastic, and I highly recommend the seaweed salad, which was one of the best I have ever had. Definitely come here as a stop before the beach; you might just think you're 2500 miles away.\n",
    "Tin Roof Bistro": "Tin Roof Bistro is a Manhattan Beach classic known for their massive wine list and new-age American classics. Some of their best dishes include the firecracker shrimp and short ribs, which come atop grits soaked in a rich jus. Everything from the appetizers to the pastas and salads are great as well, so don’t be afraid to share! The menu is pretty big, it is a great place to go with family or friends, one of whom may be a little picky.\n",
    "Sugarfish": "Where to even start for Sugarfish... They have practically revolutionized the sushi industry with their relatively affordable omakases and cute to-go presentations. Sugarfish has a price to quality ratio that is incredibly hard to beat, and that is why they have been so successful. The fish is so fresh and delicious, topped on warm rice creates pure perfection. Lots of American-style sushi has orange \"dynamite\" sauces or fried tempura in it (which has it's place!), but at Sugarfish they keep it more traditional; it is a great entry point for this style of sushi for those that have never had it before.\n",
    "Carmela": "Carmela is an ice cream lover's heaven. They make their products with the freshest of ingredients, and the quality absolutely shows though. My favorites are the brown sugar vanilla bean, lemon basil sorbet, and mint cacao nib. All of the flavors at Carmela are strong and pure, will certainly leave you craving more and more. They do it right.\n",
    "Gum Tree Cafe": "Gum Tree Cafe has a wide variety of menu items from drinks to food. They make hand squeezed juices, and my favorite is the ginger lemonade. It's on the strong and tart side, which is exactly how I like it and it was one of the first restaurants that really got it right compared to how I make it at home. Additionally, the matcha latte was delicious, and they use ceremonial grade matcha in their drinks. If you order this drink, keep in mind that Gum Tree keeps with tradition and does not sweeten their matcha without your asking. The outside area is super cute and just a walks away from Hermosa Beach if you need a refresher on a warm beach day.\n",
    "Yunomi Handroll": "If yu no mi, you know I love handrolls. Yunomi handroll bar comes with a plethora of handrolls to choose from, ranging from traditional tuna to more experimental things like salmon skin. The menu doesn't just consist of handrolls though; they also have delicious veggie starters and classic sushi appetizers as well. These factors are what distinguishes Yunomi from a place like Kazu; there are more experimental options and more things to choose from than just handrolls. Both experiences are fabulous, but something to keep in mind as you choose your sushi adventure for the night. One tip is to make sure to eat your handroll as it comes to you, or else you risk the seaweed limping and your handroll experience to be diminished. The location is also great as you can go to dessert or drinks after your salty sushi meal just a walk away. -J\n",
    "South Beverly Grill": "South Beverly Grill has been a staple of upscale Beverly Hills dining for a long time. You really can get everything here, and they do most things incredibly well. The tuna tartare, burger and grilled artichoke are some of my notable items from the menu. However, my top selection by far is the kale salad with chicken (and I normally don't like kale). I don't know what they do to this chicken, but it feels like a literal cloud biting into it and it tops off a medley of incredible flavors present in this dish. If they can get me to like a kale salad, there are true magicians here at South Beverly Grill.\n",
    "Madre": "Madre, Oaxacan restaurant and mezcaleria, not only has some of the best Mexican food around, but also serves some of the best drink to go along with it. Starting with their namesake's drink, mezcal is an oven-cooked agave alcohol, or what I like to call it: \"smokey tequila\". I personally love it, and think Madre makes incredible drinks with it including the smokey margarita, al chile, and even a mezcal tasting flight for beginners to see which ones you like the best! In terms of the food, you truly cannot go wrong; however, my go-to is usually the Madre's Enchiladas, which gives you a taste of three different incredible sauces, including my favorite: mole coloradito.\n",
    "Pizzana": "Pizzana is a wonderful Neopolitan Italian experience from start to finish. The two appetizers I had, the broccolini and cauliflower, were both delightful in their own rights and had an interesting mixture of flavors and textures. Additionally, they had a suprisingly strong kick (for Italian food) that I was pleasantly surprised by. Next, the cesare salad was great, with the fried caper and calabrian chili adding a flair to the dish you don't normally see in Caesar salads. Lastly, the star of the show, the pizzas. First, they had delicious crusts that were airy, chewy, and perfectly charred. On top, I would recommend the funghi and diavola, both providing different, yet well balanced additions to the addicting crust underneath.\n",
    "Raffi's Place": "Raffi's Place is an institution. Sprawling over what seems like three entire restaurants, it serves up some of the best Persian/Armenian food in the city. Ensure to go and share with a group because the portion sizes are large. Definitely try out any of the meaty kebabs, deeply flavored stews, and my favorite crispy rice tahdig on the side. If you love Persian food and haven't been to Raffi's, it's definitely an experience to remember.\n",
    "Porto's Bakery": "Starting from a small shop founded in 1976 to a staple of casual Los Angeles dining, Porto's is universally loved and revered as one of the best casual eateries and bakeries in the city. It seems as though at every other large event, someone will show up with a box of Porto's pastries to everyone's delight. Choose from the wide variety of pastry selections: ranging from cakes to croissants and empanadas, or get a sandwich for lunch. My favorites at Porto's however are the guava cheese strudel and potato balls. The former is crispy, fruity, creamy and delicious, while the other is savory with all the right umami flavors. In the past 50ish years, Porto's has grown to a Cuban bakery empire, and their success is certainly well deserved.\n",
    "Soban": "After winning his oscar for smash 2019 film Parasite, Bong Joon-Ho spent his entire night partying at the corner of Olympic and Norton at Soban. Soban is one of the best Korean restaurants in town, specializing in their raw soy marinated crab and braised black cod. However, they have multiple other non-seafood meat dishes that are outstanding as well like the short ribs and bulgogi. Each dish at Soban is incredibly flavorful and authentic, ranging from spicy to meaty to deliciously fermented. Soban is one of those places where you can tell there's a little love spinkled in each dish as it comes out, and you can certainly taste it in the final product as well.\n",
    "My Dung Sandwich Shop": "As you walk into this unassuming market in the middle of Chinatown, you will see the walls adorned with an assortment of produce and snacks and a friendly man greeting you at the door. Hidden to the back and the left however is the countertop, where you can order some of the best bang-for-your-buck food in LA. For $5, you can order a delicious bahn mi sandwich, ranging from a variety of meats and pâtés like pork belly, cold cuts and sardines. The roll is airy and crunchy and a perfect complement to the flavorful fillings. I personally patronize My Dung for a quick, cheap lunch. However I truly would not mind eating these delightful sandwiches at any time of day.\n",
    "Sun Nong Dan": "Sun Nong Dan is most famous for their Galbi Jjim, a monstrosity of a dish consisting of braised short ribs, rice cakes, veggies, and cheese (if you want), atop a delicious savory sauce. If cheese is desired, they come to your table and blowtorch it right in front of you, creating a creamy, cheesey topping to balance the meaty interior. The rice cakes are chewy and delicious and the meat is extremely tender. As much of the dish is braised together, each component is extremely flavorful, ranging from the smallest veggie to the short rib itself. I recommend ordering one of the large plates and going to Sun Nong Dan with a group of 3+, or if you are 2 very hungry / leftover-loving individuals."
}